app/controllers/events_controller.rb

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "starts_at", "ends_at", "all_day", "description", "created_at", "updated_at", "name_person", "name_professional", "cpf") VALUES ('sadasdsa', '2012-10-16 17:28:00.000000', '2012-10-16 17:28:00.000000', 'f', 'dasdsads', '2012-10-16 17:28:33.060502', '2012-10-16 17:28:33.060502', 'dasdsasd', '4234343242332', NULL)

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT "events".* FROM "events" WHERE "events"."id" = 5 LIMIT 1
UPDATE "events" SET "description" = 'dads', "updated_at" = '2012-10-12 17:47:15.169511' WHERE "events"."id" = 5